In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series(['kalelle', 20, 'sagittarius'], index=['name', 'age', 'sign'])
data

name        kalelle
age              20
sign    sagittarius
dtype: object

In [18]:
df = pd.DataFrame({
    'name': ['kal', 'liam', 'jorel', 'mama', 'dada'],
    'age': [20, 13, 24, 47, 51],
    'gender': ['female', 'male', 'male', 'female', 'male'],
    'status': ['married', '', 'single', 'married', 'married']
})
print(df)

    name  age  gender   status
0    kal   20  female  married
1   liam   13    male
2  jorel   24    male   single
3   mama   47  female  married
4   dada   51    male  married

In [4]:
df.drop(columns={'status'}, inplace=True)
df

    name  age  gender
0    kal   20  female
1   liam   13    male
2  jorel   24    male
3   mama   47  female
4   dada   51    male

In [5]:
df['gender'].value_counts()

gender
male      3
female    2
Name: count, dtype: int64

In [6]:
df[df['age'] >= 40]

   name  age  gender
3  mama   47  female
4  dada   51    male

In [7]:
df[df['gender'] == 'female']

   name  age  gender
0   kal   20  female
3  mama   47  female

In [8]:
df['sample_column'] = np.nan
df

    name  age  gender  sample_column
0    kal   20  female            NaN
1   liam   13    male            NaN
2  jorel   24    male            NaN
3   mama   47  female            NaN
4   dada   51    male            NaN

In [12]:
arr = np.array([ 3, 5, 4, 1, 2])
sorted = np.sort(arr)[::-1]
print(sorted)

[5 4 3 2 1]

In [15]:
df.rename(columns={'sample_column': 'sample'}, inplace=True)
df

    name  age  gender  sample
0    kal   20  female     NaN
1   liam   13    male     NaN
2  jorel   24    male     NaN
3   mama   47  female     NaN
4   dada   51    male     NaN

In [16]:
df.dropna(inplace=True)

In [17]:
df

Empty DataFrame
Columns: [name, age, gender, sample]
Index: []

In [19]:
df = pd.DataFrame({
    'name': ['kal', 'liam', 'jorel', 'mama', 'dada'],
    'age': [20, 13, 24, 47, 51],
    'gender': ['female', 'male', 'male', 'female', 'male'],
    'status': ['married', '', 'single', 'married', 'married']
})
print(df)

    name  age  gender   status
0    kal   20  female  married
1   liam   13    male
2  jorel   24    male   single
3   mama   47  female  married
4   dada   51    male  married

In [21]:
df.drop(columns={'status'}, inplace=True)
df

    name  age  gender
0    kal   20  female
1   liam   13    male
2  jorel   24    male
3   mama   47  female
4   dada   51    male

In [24]:
df['test_column'] = np.nan

In [25]:
df

    name  age  gender  test_column
0    kal   20  female          NaN
1   liam   13    male          NaN
2  jorel   24    male          NaN
3   mama   47  female          NaN
4   dada   51    male          NaN

In [28]:
df['test_column'] = df['test_column'].fillna('none')
df

    name  age  gender test_column
0    kal   20  female        none
1   liam   13    male        none
2  jorel   24    male        none
3   mama   47  female        none
4   dada   51    male        none

In [ ]:
df.sort_values(by='age', ascending=True, inplace=True)
print(df)

    name  age  gender test_column
1   liam   13    male        none
0    kal   20  female        none
2  jorel   24    male        none
3   mama   47  female        none
4   dada   51    male        none

In [41]:
df[['age', 'gender']]

   age  gender
1   13    male
0   20  female
2   24    male
3   47  female
4   51    male

In [42]:
df['is_cute'] = np.nan
df

    name  age  gender test_column  is_cute
1   liam   13    male        none      NaN
0    kal   20  female        none      NaN
2  jorel   24    male        none      NaN
3   mama   47  female        none      NaN
4   dada   51    male        none      NaN

In [43]:
df['is_cute'] = df['is_cute'].astype(bool)
df

    name  age  gender test_column  is_cute
1   liam   13    male        none     True
0    kal   20  female        none     True
2  jorel   24    male        none     True
3   mama   47  female        none     True
4   dada   51    male        none     True

In [44]:
df['is_cute'].value_counts()

is_cute
True    5
Name: count, dtype: int64

In [45]:
df.describe()

             age
count   5.000000
mean   31.000000
std    16.955825
min    13.000000
25%    20.000000
50%    24.000000
75%    47.000000
max    51.000000